Revit 2027 API
ExportLayerTable.GetValues Method
 Returns all the values stored in the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<ExportLayerInfo> GetValues()
Public Function GetValues As IList(Of ExportLayerInfo)
public:
IList<ExportLayerInfo^>^ GetValues()
member GetValues : unit -> IList<ExportLayerInfo>
Return Value
IList<ExportLayerInfo>
 Return the info array.
See Also
Reference
ExportLayerTable Class
Autodesk.Revit.DB Namespace